use strict;
use warnings;
use lib 'lib';
use encoding "euc-jp", STDOUT => "euc-jp";

use Data::Dumper;
use Geography::AddressExtract::Japan;


my $ex  = Geography::AddressExtract::Japan->extract('º£Ç¯¤Ï½ÂÃ«¶è¸¶½É¤Î¥¿¥¤¥Õ¥§¥¹¥Æ¥£¥Ğ¥ë¹Ô¤Ã¤Æ¿ÀÆàÀî¸©³ùÁÒ»Ô³ùÁÒ¤Ë¤¤¤Ã¤¿
½»½ê¤ÏÅìµşÅÔ¹Á¶èÏ»ËÜÌÚ6-15-21¡¡
ÅìµşÅÔ¹Á¶èËÜÌÚ6-15-21¡¡

Âçºå»ÔÆ»ÆÜËÙ°ìÃúÌÜÅì£±ÈÖ
»¥ËÚ»Ô¾åÄ®£ÁÈÖ£·¹æ¤«¤é
»¥ËÚ»ÔÉÍ£µ¡İÆî£±¡İ£²£±¤Ë¤¤¤¤¤Æ
»¥ËÚ»Ô£µ¾òÄÌ£±£±ÃúÌÜ±¦£±¹æ¤ª¤¯¤È
»¥ËÚ»Ô¿ÀÄ®±ÄÃÄÂçÄÌ¤ê£´£·¹æ
»¥ËÚ»ÔÂÀÅÄ£µ¤ÎÄÌ¤ê23ÈÖÃÏ£±
»¥ËÚ»Ô¤¢¤Ş¤Î1ÃúÌÜ87
»¥ËÚ»Ô°ìÃúÌÜ
»¥ËÚ»Ô°ìÃúÌÜ87
»¥ËÚ»Ô°ìÃúÌÜ776-89
»¥ËÚ»Ô°íÃúÌÜ2-3¤¢¤¢
»¥ËÚ»Ô°ğÅÄÄ®Æî9ÀşÀ¾11-1
½ÂÃ«¶è¸¶½É¤Ë

ÅìµşÅÔ½ÂÃ«¶è¿ÀµÜÁ°¤Î½»½ê°ìÍ÷
Mapion ? ½»½ê°ìÍ÷¤«¤éÃµ¤¹ ? ÅìµşÅÔ ? ½ÂÃ«¶è ¿ÀµÜÁ°. ÅìµşÅÔ½ÂÃ«¶è¿ÀµÜÁ°¤Î½»½ê°ìÍ÷. £±ÃúÌÜ ? £²ÃúÌÜ ? £³ÃúÌÜ ? £´ÃúÌÜ ? £µÃúÌÜ ? £¶ÃúÌÜ. ¢¨¾åµ­¤Î½»½ê°ìÍ÷¤ÏÁ´¤Æ¤Î½»½ê ¤¬ÌÖÍå¤µ¤ì¤Æ¤¤¤ë¤³¤È¤òÊİ¾Ú¤¹¤ë¤â¤Î¤Ç¤Ï¤¢¤ê¤Ş¤»¤ó¡£ ...
www.mapion.co.jp/html/AddressList/13/13113/15/index.html - 5k - ¥­¥ã¥Ã¥·¥å - ´ØÏ¢¥Ú¡¼¥¸

    Â¾¡¢map.yahoo.co.jpÆâ¤Î¥Ú¡¼¥¸ ]

¿ÀÆàÀî¸©²£ÉÍ»ÔÎĞ¶è¾®»³Ä®¤Î½»½ê°ìÍ÷
Mapion ? ½»½ê°ìÍ÷¤«¤éÃµ¤¹ ? ¿ÀÆàÀî¸© ? ²£ÉÍ»ÔÎĞ¶è ¾®»³Ä®. ¿ÀÆàÀî¸©²£ÉÍ»ÔÎĞ¶è¾®»³Ä® ¤Î½»½ê°ìÍ÷. £±£´ ? £²£¸£µ ? £²£¸£¶ ? £²£¸£· ? £²£¸£¸ ? £²£¸£¹ ? £²£¹£° ? £²£¹£± ? £²£¹£² ? £²£¹£³ ? £²£¹£´ ? £³£°£¸ ? £³£°£¹ ? £³£²£° ? £³£²£± ? £³£²£² ...
www.mapion.co.jp/html/AddressList/14/14113/8/index.html - 23k - ¥­¥ã¥Ã¥·¥å - ´ØÏ¢¥Ú¡¼¥¸

    ÀéÍÕ¸©ÀéÍÕ»ÔÎĞ¶è¾®»³Ä®¤Î½»½ê°ìÍ÷
    Mapion ? ½»½ê°ìÍ÷¤«¤éÃµ¤¹ ? ÀéÍÕ¸© ? ÀéÍÕ»ÔÎĞ¶è ¾®»³Ä®. ÀéÍÕ¸©ÀéÍÕ»ÔÎĞ¶è¾®»³Ä® ¤Î½»½ê°ìÍ÷. £²£· ? £³£´ ? £±£±£¹ ? £±£²£± ? £±£²£¸ ? £±£´£° ? £±£´£¶ ? £±£´£· ? £±£´£¸ ? £±£´£¹ ? £±£¶£´ ? £±£¶£¹ ? £±£·£³ ? £³£µ£· ? £³£µ£¹ ...
    www.mapion.co.jp/html/AddressList/12/12105/10/index.html - 7k -

2003Ç¯ÅÙÁ°´ü¥¹¥±¥¸¥å¡¼¥ë¡§Å¸Í÷²ñ¾ğÊó
²ñ¾ì, ¥®¥ã¥é¥ê¡¼²è¾²µşÅÔ»ÔÃæµş¶è¿·µş¶ËÏ»³ÑÅìÆş¤ë452-4 SUPER GROUND BUILD B1F Tel¡§075-257-1950 Fax¡§075-257-1960 Mail¡§worldim@gold.ocn.ne.jp ²Ï¸¶Ä®ÄÌ¥Ö
¥Ã¥¯¥Õ¥¡¡¼¥¹¥È¤òº¸Æş¤ë¿·µş¶ËÄÌ¤ê¥¹¥¿¡¼¥Ğ¥Ã¥¯¥¹¤ò±¦Æş¤ëÍÎÉş²°TeMas¤ÎÃÏ²¼ ...
www.kyoto-seika.ac.jp/exhibition/schedule/y2003_1.html - 49k - ¥­¥ã¥Ã¥·¥å - ´ØÏ¢¥Ú¡¼¥¸
                                                                                                                                                          
¥ª¡¼¥¬¥Ë¥Ã¥¯¥ì¥¹¥È¥é¥ó
£³, µşÅÔ»ÔÃæµş¶è°áºôÄÌ¸æÃÓ¾å¥ë²¼Ì¯³Ğ»ûÄ®199 ¥¤¥Á¥¤¥Ó¥ë£±F ÃÏ²¼Å´¸æÃÓ±Ø£²ÈÖ½Ğ¸ı¤è¤êÅÌÊâ£µÊ¬. £´, 075-223-6623 ... ºåµŞÊõÄÍÀş»°¹ñ±Ø²¼¼Ö¡¦±ØÁ°¾¦Å¹³¹¤òÅÌÊâ£²
Ê¬±¦Æş¤ë. £´, 06-394-7480. £µ, 10¡§30¡Á20¡§30¡Ê¥ª¡¼¥À¡¼¥¹¥È¥Ã¥×¡Ë ...
www.ecology.or.jp/9803/spepro3.html - 14k - ¥­¥ã¥Ã¥·¥å - ´ØÏ¢¥Ú¡¼¥¸
                                                                                                                                                          
¼«Á³¿©¥ì¥¹¥È¥é¥ó
075-781-9720 11¡§30¡Á14¡§30¡¿17¡§30¡Á20¡§30 ·îÍËÆüÄêµÙ£Ó£õ£ê£á£ô£áµşÅÔÉÜµşÅÔ»Ôº¸µş¶èËÌÇòÀî¾åÊÌÅö£³¡İ£¶ ... ºåµŞÊõÄÍÀş»°¹ñ±Ø²¼¼Ö¡¦±ØÁ°¾¦Å¹³¹¤òÅÌÊâ£²Ê¬±¦Æş
¤ë 06-394-7480 10¡§30¡Á20¡§30¡Ê¥ª¡¼¥À¡¼¥¹¥È¥Ã¥×¡ËÌµµÙ¥Ù¥¸¥¿¥Ö¥ë¼«Á³¿©ÎÁÍı ...
www.cam.hi-ho.ne.jp/h_sakamoto/food/shop/shop.htm - 14k - ¥­¥ã¥Ã¥·¥å - ´ØÏ¢¥Ú¡¼¥¸
                                                                                                                                                          
ÃÏ¶èÊÌÅ¹ÊŞ°ìÍ÷¡ÊÃÏ°è¤«¤é¤µ¤¬¤¹¡Ë : »°É©£Õ£Æ£Ê¿®Â÷¶ä¹Ô
(JR¸ŞÈ¿ÅÄ±ØÀ¾¸ıÁ°), 03-3492-1411. ¼«Í³¥öµÖ»ÙÅ¹, 142, £Õ£Æ£Ê¿®Â÷, ÅìµşÅÔÌÜ¹õ¶è¼«Í³¤¬µÖ2¡İ10¡İ22 (¼«Í³¤¬µÖ±ØÁ°¡¦Ëª¤Î²È±¦Æş¤ë), 03-3718-1147 ... µşÅÔ»ÙÅ¹,
610, »°É©¿®Â÷, µşÅÔÉÜµşÅÔ»Ô²¼µş¶è»Í¾òÄÌÅìÆ¶±¡³Ñ(»Í¾òÄÌ¤êÂç´İÀ¾ÊÂ¤Ó), 075-211-7161 ...
www.tr.mufg.jp/ippan/tenpo/chiiki_list.html - 34k - ¥­¥ã¥Ã¥·¥å - ´ØÏ¢¥Ú¡¼¥¸

Yahoo!ÃÏ°è¾ğÊó - ÂçºåÉÜ - Âçºå»Ô - ¥°¥ë¥á
ÂÀÍÛÜìÃæ²Ú¥Ğ¥¤¥­¥ó¥°Âçºå¥æ¥Ë¥Ğ¡¼¥µ¥ëÅ¹, ÂçºåÉÜÂçºå»Ôº¡²Ö¶èÅç²°6-2-61 ¥æ¥Ë¥Ğ¡¼¥µ¥ë¡¦¥·¥Æ¥£¥¦¥©¡¼¥¯Âçºå5F, ÃÏ¿Ş¤òÉ½¼¨¤¹¤ë, Ãæ¹ñÎÁÍıÅ¹, Yahoo!¥¯¡¼¥İ¥ó¥¯¡¼¥İ
¥ó . Aiight¡ªÂÀÍÛÜìÏÂÍÎÃæ¿©¤ÙÊüÂê°û¤ßÊüÂêÆ»ÆÜËÙÅ¹, ÂçºåÉÜÂçºå»ÔÃæ±û¶è ...
local.yahoo.co.jp/a127/a227100/g103/ - 37k - ¥­¥ã¥Ã¥·¥å - ´ØÏ¢¥Ú¡¼¥¸
                                                                                                                                                          
Âçºå»Ô - Chakuwiki
Æ»ÆÜËÙÀî¤Ë²Í¤«¤Ã¤Æ¤¤¤ë¤Î¤¬½¿¶¶¡Ê¤Ò¤Ã¤«¤±¶¶¡Ë¤Ç¤¹¡£º£µÜ½¿¤ËÄÌ¤¸¤ë¶¶¤Ç¤¢¤Ã¤¿»ö¤«¤é¤³¤ÎÌ¾Á°¤¬¤Ä¤¤¤¿¤é¤·¤¤¡£¤½¤Î½¿¶¶¤ÏÂşº£²Í¤±ÂØ¤¨¤Î¿¿¤ÃºÇÃæ¤Ç¤¢¤ë¡£´Ñ¸÷µÒ¤¬
Â¿¤¤°Ù¡¢Âçºå»ÔÆâ¤Ç¤ÏºÇ¤âÉ¸½à¸ì¤¬¤¤¤¿¤ë½ê¤«¤éÊ¹¤³¤¨¤Æ¤¯¤ë³¹¤Ç¤â¤¢¤ë¡£ ...
wiki.chakuriki.net/index.php/ %E9%81%93%E9%A0%93%E5%A0%80 - 38k - ¥­¥ã¥Ã¥·¥å - ´ØÏ¢¥Ú¡¼¥¸
                                                                                                                                                          
Âçºå»Ô¤Îµï¼ò²°/¥Ğ¡¼/¥æ¡¼¥³¥ìÂçºå
ÂçºåÆ»ÆÜËÙ¤Î20Ç¯¤ÎÅÁÅı¤¢¤ëµï¼ò²°ÅÛ¡£Å¹Æâ¤Ï³¤¤ò¥â¥Á¡¼¥Õ¤Ë¤·¤¿Æî¹ñ¥ê¥é¥Ã¥¯¥¹¥à. ¡¦¹¹¿·Æü2005/09/27 ¡¦Âçºå»Ô¡¦µï¼ò²°/¥Ğ¡¼. Âçºå»Ô¤Îµï¼ò²°/¥Ğ¡¼/µï¼ò²°ÅÛÂçºå»ÔÆ»ÆÜËÙ2-4-2ÊõÀô. ½»½ê. ¡§Âçºå»ÔÆ»ÆÜËÙ2-4-2ÊõÀô¥Ó¥ë2F. ÅÅÏÃÈÖ¹æ. ¡§06-6212-3326 ...
osakashi.yuc.jp/search/search.php?genre_code=6 - 24k - ¥­¥ã¥Ã¥·¥å - ´ØÏ¢¥Ú¡¼¥¸

Âçºå»ÔÆ»ÆÜËÙÆó¤Î»Í¤ÎÆó¤È¤¤¤¦É½µ­

ÅìµşÅÔÌÜ¹õ¶è¼«Í³¤¬µÖ°ì-»°-»Í¡»¶å

¿À¸Í»Ô¤ÎÀ¾ÃÏ¶è¤È»Ô±ÄÃÏ²¼Å´³Ø±àÅÔ»Ô¤ÇµŞ20¤Ë¤Î¤Ã¤Æ

ÀéÍÕ¸©»ÔÀî»ÔÌò½ê¤ÈÀéÍÕ¸©Á¥¶¶»Ô¾ÃËÉ¶É¤Ç¤¹¡£

Ê¡²¬»Ô±³5ÃÏ³ä

°°»Ô¥¤33094-10¤È¤«°°»Ô¥í¤Î3864¤Î98¤È¤«¤¤¤¦½»½ê

¹¾¸ÍÀî¶è³ëÀ¾2-3-0921
¹¾¸ÍÀî¶è³ëÀ¾2¤Î3¤Î»Í¡»¶å»Í¡»¶å
¹¾¸ÍÀî¶è³ëÀ¾2¤Î¶åÈÖ»Í¡»¶å»Í¡»¹æ
¹¾¸ÍÀî¶è³ëÀ¾2¤Î¶åÈÖÃÏ»Í¡»¶å»Í¡»¹æ
');

#print Dumper($ex);

for (@$ex) {
    print "[$_]\n";
    print "    I:" . $_->index . " CITY: " . $_->city . " / Aza: " . $_->aza . " / NUMBER: " . $_->number . "\n";
}
